balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ256GB206.PIC
        <edc:SFRDef edc:access="nnnnnnnnn---n---" edc:cname="PMCS1BS" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000100---0---" edc:name="PMCS1BS" edc:nzwidth="16" edc:por="000000100---0---">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="BASE11" edc:desc="" edc:mask="0x1" edc:name="BASE11" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="BASE15" edc:desc="" edc:mask="0x1" edc:name="BASE15" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BASE16" edc:desc="" edc:mask="0x1" edc:name="BASE16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BASE17" edc:desc="" edc:mask="0x1" edc:name="BASE17" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BASE18" edc:desc="" edc:mask="0x1" edc:name="BASE18" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BASE19" edc:desc="" edc:mask="0x1" edc:name="BASE19" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BASE20" edc:desc="" edc:mask="0x1" edc:name="BASE20" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BASE21" edc:desc="" edc:mask="0x1" edc:name="BASE21" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BASE22" edc:desc="" edc:mask="0x1" edc:name="BASE22" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BASE23" edc:desc="" edc:mask="0x1" edc:name="BASE23" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn------nnnnnnnn" edc:cname="PMCS1MD" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00------00000000" edc:name="PMCS1MD" edc:nzwidth="16" edc:por="00------00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DWAITE" edc:desc="" edc:mask="0x3" edc:name="DWAITE" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="DWAITM" edc:desc="" edc:mask="0xf" edc:name="DWAITM" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="DWAITB" edc:desc="" edc:mask="0x3" edc:name="DWAITB" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="ACKM" edc:desc="" edc:mask="0x3" edc:name="ACKM" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DWAITE0" edc:desc="" edc:mask="0x1" edc:name="DWAITE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DWAITE1" edc:desc="" edc:mask="0x1" edc:name="DWAITE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DWAITM0" edc:desc="" edc:mask="0x1" edc:name="DWAITM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DWAITM1" edc:desc="" edc:mask="0x1" edc:name="DWAITM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DWAITM2" edc:desc="" edc:mask="0x1" edc:name="DWAITM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DWAITM3" edc:desc="" edc:mask="0x1" edc:name="DWAITM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DWAITB0" edc:desc="" edc:mask="0x1" edc:name="DWAITB0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DWAITB1" edc:desc="" edc:mask="0x1" edc:name="DWAITB1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ACKM0" edc:desc="" edc:mask="0x1" edc:name="ACKM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ACKM1" edc:desc="" edc:mask="0x1" edc:name="ACKM1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn-nnnnnn-----" edc:cname="PMCS2CF" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-000000-----" edc:name="PMCS2CF" edc:nzwidth="16" edc:por="0000-000000-----">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PTSZ" edc:desc="" edc:mask="0x3" edc:name="PTSZ" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="ACKP" edc:desc="" edc:mask="0x1" edc:name="ACKP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SM" edc:desc="" edc:mask="0x1" edc:name="SM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RDSP" edc:desc="" edc:mask="0x1" edc:name="RDSP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WRSP" edc:desc="" edc:mask="0x1" edc:name="WRSP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="BEP" edc:desc="" edc:mask="0x1" edc:name="BEP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSPTEN" edc:desc="" edc:mask="0x1" edc:name="CSPTEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSP" edc:desc="" edc:mask="0x1" edc:name="CSP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSDIS" edc:desc="" edc:mask="0x1" edc:name="CSDIS" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="PTSZ0" edc:desc="" edc:mask="0x1" edc:name="PTSZ0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTSZ1" edc:desc="" edc:mask="0x1" edc:name="PTSZ1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnn---n---" edc:cname="PMCS2BS" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000001100---0---" edc:name="PMCS2BS" edc:nzwidth="16" edc:por="000001100---0---">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="BASE11" edc:desc="" edc:mask="0x1" edc:name="BASE11" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="BASE15" edc:desc="" edc:mask="0x1" edc:name="BASE15" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BASE16" edc:desc="" edc:mask="0x1" edc:name="BASE16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BASE17" edc:desc="" edc:mask="0x1" edc:name="BASE17" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BASE18" edc:desc="" edc:mask="0x1" edc:name="BASE18" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BASE19" edc:desc="" edc:mask="0x1" edc:name="BASE19" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BASE20" edc:desc="" edc:mask="0x1" edc:name="BASE20" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BASE21" edc:desc="" edc:mask="0x1" edc:name="BASE21" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BASE22" edc:desc="" edc:mask="0x1" edc:name="BASE22" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BASE23" edc:desc="" edc:mask="0x1" edc:name="BASE23" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn------nnnnnnnn" edc:cname="PMCS2MD" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00------00000000" edc:name="PMCS2MD" edc:nzwidth="16" edc:por="00------00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DWAITE" edc:desc="" edc:mask="0x3" edc:name="DWAITE" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="DWAITM" edc:desc="" edc:mask="0xf" edc:name="DWAITM" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="DWAITB" edc:desc="" edc:mask="0x3" edc:name="DWAITB" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="ACKM" edc:desc="" edc:mask="0x3" edc:name="ACKM" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DWAITE0" edc:desc="" edc:mask="0x1" edc:name="DWAITE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DWAITE1" edc:desc="" edc:mask="0x1" edc:name="DWAITE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DWAITM0" edc:desc="" edc:mask="0x1" edc:name="DWAITM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DWAITM1" edc:desc="" edc:mask="0x1" edc:name="DWAITM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DWAITM2" edc:desc="" edc:mask="0x1" edc:name="DWAITM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DWAITM3" edc:desc="" edc:mask="0x1" edc:name="DWAITM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DWAITB0" edc:desc="" edc:mask="0x1" edc:name="DWAITB0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DWAITB1" edc:desc="" edc:mask="0x1" edc:name="DWAITB1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ACKM0" edc:desc="" edc:mask="0x1" edc:name="ACKM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ACKM1" edc:desc="" edc:mask="0x1" edc:name="ACKM1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="PMDOUT1" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="PMDOUT1" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PMDOUT1" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="PMDOUT1" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="PMDOUT2" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="PMDOUT2" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PMDOUT2" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="PMDOUT2" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="PMDIN1" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="PMDIN1" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PMDIN1" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="PMDIN1" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="PMDIN2" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="PMDIN2" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PMDIN2" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="PMDIN2" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rn--rrrrrn--rrrr" edc:cname="PMSTAT" edc:desc="" edc:impl="0xcfcf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00--000010--1111" edc:name="PMSTAT" edc:nzwidth="0x10" edc:por="00--000010--1111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OB0E" edc:desc="" edc:mask="0x1" edc:name="OB0E" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OB1E" edc:desc="" edc:mask="0x1" edc:name="OB1E" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OB2E" edc:desc="" edc:mask="0x1" edc:name="OB2E" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OB3E" edc:desc="" edc:mask="0x1" edc:name="OB3E" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="OBUF" edc:desc="" edc:mask="0x1" edc:name="OBUF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OBE" edc:desc="" edc:mask="0x1" edc:name="OBE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IB0F" edc:desc="" edc:mask="0x1" edc:name="IB0F" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IB1F" edc:desc="" edc:mask="0x1" edc:name="IB1F" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IB2F" edc:desc="" edc:mask="0x1" edc:name="IB2F" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IB3F" edc:desc="" edc:mask="0x1" edc:name="IB3F" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="IBOV" edc:desc="" edc:mask="0x1" edc:name="IBOV" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IBF" edc:desc="" edc:mask="0x1" edc:name="IBF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="ALRMVAL" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="ALRMVAL" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ALRMVAL" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="ALRMVAL" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
